Public Attributes | List of all members
API_Attribute Union Reference
Attribute Management
Describes the different attributes. More...
#include <APIdefs_Attributes.h>
 Public Attributes
API_Attr_Head  | header
A common header for all the attribute types. It contains information which applies to all the attribute types.
API_LayerType  | layer
A layer attribute.
API_LinetypeType  | linetype
A line type attribute.
API_FilltypeType  | filltype
A fill type attribute.
API_CompWallType  | compWall
A composite wall attribute.
API_MaterialType  | material
A material attribute.
API_LayerCombType  | layerComb
A layer combination attribute.
API_ZoneCatType  | zoneCat
A zone category attribute.
API_ProfileAttrType  | profile
A custom profile attribute for walls, beams, and columns.
API_PenTableType  | penTable
A named pen table attribute..
API_MEPSystemType  | mepSystem
A MEP System attribute.
API_OperationProfileType  | operationProfile
An Energy Evaluation operation profile.
API_BuildingMaterialType  | buildingMaterial
A building material attribute.
Detailed Description
Describes the different attributes.
Remarks
Database items named attributes are global collections of layers, pen colors, surface materials, fill patterns, etc. that are available to all eligible tools. They are referenced by indices and changes to an attribute effects every element that uses that attribute. Attributes can be accessed and edited through the Options menu. API functions operating on the attribute set begin with the ACAPI_Attribute_ prefix, refer to the Attribute Manager for more details. Many attribute related functions use the API_Attribute structure on the parameter list. As a general rule, you have to fill the required fields in the union, then Archicad parses the request based on the values, and passes the return parameters in the same parameter. This is why most of the functions do not have the const directive in the prototypes.
Member Data Documentation
◆ buildingMaterial
 API_Attribute::buildingMaterial
A building material attribute.
◆ compWall
 API_Attribute::compWall
A composite wall attribute.
◆ filltype
 API_Attribute::filltype
A fill type attribute.
◆ header
 API_Attribute::header
A common header for all the attribute types. It contains information which applies to all the attribute types.
◆ layer
 API_Attribute::layer
A layer attribute.
◆ layerComb
 API_Attribute::layerComb
A layer combination attribute.
◆ linetype
 API_Attribute::linetype
A line type attribute.
◆ material
 API_Attribute::material
A material attribute.
◆ mepSystem
 API_Attribute::mepSystem
A MEP System attribute.
◆ operationProfile
 API_Attribute::operationProfile
An Energy Evaluation operation profile.
◆ penTable
 API_Attribute::penTable
A named pen table attribute..
◆ profile
 API_Attribute::profile
A custom profile attribute for walls, beams, and columns.
◆ zoneCat
 API_Attribute::zoneCat
A zone category attribute.